# 8.3_chetnoe_nechetnoe

Вывести сначала чётные элементы массива, а затем нечётные.

Входные данные:
Первая строка число 
N
,
(
N
>
0
)
N,(N>0) -- длина массива. Длина массива не более 100 элементов. Вторая строка 
N
N  натуральных чисел, записанных через пробел

Выходные данные: 
Элементы массива, упорядоченные соответствующим образом. Сначала чётные элементы массива в том порядке, как они встречаются в массиве, затем нечётные элементы массива в том порядке, как они встречаются в массиве.

Подсказки: 
обратите внимание на примеры входных и выходных данных

#include <stdio.h>
#include <stdlib.h>
#include <math.h>
 
int main(){
    int s=0;
    int n;
    int i;
    int array[100];
    int nech = 0;
 
    scanf("%d",&n);

    for (i=0; i<n; i++)
    {
        scanf("%d", &array[i]);
    }
  
    for (i=0; i<n; i++)
    {
        if (array[i]%2==0)
        {
            printf(" %d",array[i]);
            s++;
        }
    } 

    for (i=0; i<n; i++)
    {
      if ((array[i]%2)==1)
            printf(" %d", array [i]);
            ++nech;
    }
    return 0;
 
}
